# ERD diagram

![ERD Diagram](./mermaid.svg)

In [34]:
import sqlite3

def connect_to_db(db_name: str):
    try:
        conn = sqlite3.connect(db_name)
        print(f"Connected to database {db_name} successfully.")
        return conn
    except sqlite3.Error as e:
        print(f"Error connecting to database: {e}")
        return None

def create_table(conn: sqlite3.Connection, query: str) -> None:
    try:
        cursor = conn.cursor()
        cursor.execute(query)
        conn.commit()
        print("Table created successfully.")
    except sqlite3.Error as e:
        print(f"Error creating table: {e}")

def insert_data(conn: sqlite3.Connection, query: str, data: tuple) -> None:
    try:
        cursor = conn.cursor()
        cursor.execute(query, data)
        conn.commit()
        print("Data inserted successfully.")
    except sqlite3.Error as e:
        print(f"Error inserting data: {e}")

In [35]:
customers_table_sql = """
CREATE TABLE customers (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    surname TEXT NOT NULL,
    birthdate DATE NOT NULL,
    address TEXT,
    zipcode TEXT,
    phone_number TEXT
);
"""

loans_table_sql = """
CREATE TABLE loans (
    id INTEGER PRIMARY KEY,
    contract_start_date DATE NOT NULL,
    contract_end_date DATE NOT NULL,
    total_amount REAL NOT NULL,
    payment_frequency TEXT DEFAULT 'Monthly',
    payment_amount REAL NOT NULL,
    status TEXT DEFAULT 'Active',

    -- To connect loans to customers
    customer_id INTEGER NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES customers (id)
);
"""

payments_table_sql = """
CREATE TABLE payments (
    id INTEGER PRIMARY KEY,
    payment_due_date DATE NOT NULL,
    amount_paid REAL,
    payment_date DATE,

    loan_id INTEGER NOT NULL,
    FOREIGN KEY (loan_id) REFERENCES loans (id)
);
"""

In [36]:
# Create the tables
db_connection = connect_to_db("atrato.db")

if db_connection:
    create_table(db_connection, customers_table_sql)
    create_table(db_connection, loans_table_sql)
    create_table(db_connection, payments_table_sql)
    db_connection.close()

Connected to database atrato.db successfully.
Table created successfully.
Table created successfully.
Table created successfully.

In [37]:
customers_insert_sql = """
INSERT INTO customers (name, surname, birthdate, address, zipcode, phone_number)
VALUES (?, ?, ?, ?, ?, ?);
"""

loans_insert_sql = """
INSERT INTO loans (contract_start_date, contract_end_date, total_amount, payment_frequency, payment_amount, status, customer_id)
VALUES (?, ?, ?, ?, ?, ?, ?);
"""

payments_insert_sql = """
INSERT INTO payments (payment_due_date, amount_paid, payment_date, loan_id)
VALUES (?, ?, ?, ?);
"""

In [38]:
customers_data = [
    ("Alfredo", "Gutiérrez", "2001-01-08", "Calle muy bonita 123", "07300", "4646503012"),
    ("Juanito", "Pérez", "1995-05-15", "Avenida siempre viva 742", "99999", "1234567890"),
    ("Perenganito", "López", "1988-12-30", "Boulevard de los sueños rotos 456", "716532", "0987654321"),
    ("Homero", "Simpson", "1970-05-12", "Avenida siepreviva 783", "4832742", "5551234567"),
    ("Luis", "Miguel", "1985-04-19", "Calle del sol 456", "9432723", "4449876543"),
    ("José", "José", "1990-11-23", "Calle luna 789", "111111", "3335678901"),
    ("Juan", "Gabriel", "1975-01-07", "Avenida estrellas 321", "1264823", "2223456789"),
]

loans_data = [
    ("2025-01-01", "2025-01-01", 1200.00, "Monthly", 100.00, "Active", 1),
    ("2025-06-15", "2025-06-15", 6000.00, "Monthly", 500.00, "Completed", 2),
    ("2025-03-20", "2025-03-20", 2400.00, "Monthly", 200.00, "Active", 3),
    ("2025-09-10", "2025-09-10", 3000.00, "Monthly", 250.00, "Completed", 4),
    ("2024-05-05", "2024-05-05", 1500.00, "Monthly", 125.00, "Active", 5),
    ("2025-12-01", "2025-12-01", 4800.00, "Monthly", 400.00, "Active", 6),
    ("2025-07-15", "2025-07-15", 3600.00, "Monthly", 300.00, "Active", 7),

    ("2025-08-01", "2025-08-01", 2400.00, "Monthly", 200.00, "Active", 2),
    ("2026-01-01", "2026-01-01", 4800.00, "Monthly", 400.00, "Active", 6),
    ("2025-08-15", "2025-08-15", 3600.00, "Monthly", 300.00, "Active", 7),
]

payments_data = [
    ("2025-02-01", 100.00, "2025-02-01", 1),
    ("2025-03-01", 100.00, "2025-03-01", 1),
    ("2025-07-15", 500.00, "2025-07-15", 2),
    ("2025-08-15", 500.00, "2025-08-15", 2),
    ("2025-04-20", 200.00, "2025-04-20", 3),
    ("2025-05-20", 200.00, "2025-05-20", 3),
    ("2025-10-10", 250.00, "2025-10-10", 4),
    ("2024-06-05", 125.00, "2024-06-05", 5),
    ("2024-07-05", 125.00, "2024-07-05", 5),
    ("2025-12-01", 400.00, "2025-12-01", 6),
    ("2026-01-01", 400.00, "2026-01-01", 6),
    ("2025-08-15", 300.00, "2025-08-15", 7),
    ("2025-09-15", 300.00, "2025-09-15", 7),
]

In [39]:
# insert the data
db_connection = connect_to_db("atrato.db")

if db_connection:
    for customer in customers_data:
        insert_data(db_connection, customers_insert_sql, customer)
    
    for loan in loans_data:
        insert_data(db_connection, loans_insert_sql, loan)
    
    for payment in payments_data:
        insert_data(db_connection, payments_insert_sql, payment)
    
    db_connection.close()

Connected to database atrato.db successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.
Data inserted successfully.

In [40]:
import pandas as pd

def execute_query(db_name: str, query: str) -> pd.DataFrame:
    conn = connect_to_db(db_name)
    if conn:
        df = pd.read_sql_query(query, conn)
        conn.close()
        return df
    else:
        return pd.DataFrame()

In [41]:
# Select all customers that have multiple active loans
query_1 = """
SELECT
    c.id as customer_id,
    c.name,
    c.surname,
    COUNT(l.id) AS active_loan_count
FROM
    customers c
JOIN
    loans l ON c.id = l.customer_id
WHERE
    l.status = 'Active'
GROUP BY
    c.id, c.name, c.surname
HAVING
    COUNT(l.id) > 1;
"""

df1 = execute_query("atrato.db", query_1)
print("Customers with multiple active loans:")
df1

Connected to database atrato.db successfully.
Customers with multiple active loans:

   customer_id  name  surname  active_loan_count
0            6  José     José                  2
1            7  Juan  Gabriel                  2

In [42]:
# Select all customers that have made two consecutive payments of any of their active loans.
query_2 = """
WITH ConsecutivePayments AS (
    -- Use ROW_NUMBER to identify consecutive payments for each loan
    SELECT
        l.customer_id,
        p.loan_id,
        p.payment_due_date,
        p.amount_paid,
        ROW_NUMBER() OVER (PARTITION BY p.loan_id ORDER BY p.payment_due_date) as payment_sequence
    FROM
        payments p
    JOIN
        loans l ON p.loan_id = l.id
    WHERE
        p.amount_paid IS NOT NULL AND l.status = 'Active'
),

-- Find loans where we have at least 2 consecutive payments
ConsecutiveLoans AS (
    SELECT DISTINCT
        customer_id,
        loan_id
    FROM ConsecutivePayments cp1
    WHERE EXISTS (
        SELECT 1 
        FROM ConsecutivePayments cp2 
        WHERE cp2.loan_id = cp1.loan_id 
        AND cp2.payment_sequence = cp1.payment_sequence + 1
    )
)

-- Get customer details
SELECT DISTINCT
    c.id as customer_id,
    c.name,
    c.surname
FROM
    customers c
JOIN
    ConsecutiveLoans cl ON c.id = cl.customer_id;
"""

df2 = execute_query("atrato.db", query_2)
print("Customers with two consecutive payments on active loans:")
df2

Connected to database atrato.db successfully.
Customers with two consecutive payments on active loans:

   customer_id         name    surname
0            1      Alfredo  Gutiérrez
1            3  Perenganito      López
2            5         Luis     Miguel
3            6         José       José
4            7         Juan    Gabriel

In [43]:
# Select the total amount paid and the average number of payments made by
# customers that have only one active loan.
query_3 = """
WITH SingleLoanCustomers AS (
    -- CTE to find customers with exactly one active loan
    SELECT
        customer_id
    FROM
        loans
    WHERE
        status = 'Active'
    GROUP BY
        customer_id
    HAVING
        COUNT(id) = 1
)
-- Calculate aggregates for these customers
SELECT
    c.id as customer_id,
    c.name,
    c.surname,
    SUM(p.amount_paid) AS total_amount_paid,
    AVG(p.amount_paid) AS average_payment_amount
FROM
    customers c
JOIN
    loans l ON c.id = l.customer_id
JOIN
    payments p ON l.id = p.loan_id
WHERE
    c.id IN (SELECT customer_id FROM SingleLoanCustomers) AND p.amount_paid IS NOT NULL
GROUP BY
    c.id, c.name, c.surname;
"""

df3 = execute_query("atrato.db", query_3)
print("Aggregates for customers with a single active loan:")
df3

Connected to database atrato.db successfully.
Aggregates for customers with a single active loan:

,customer_id,name,surname,total_amount_paid,average_payment_amount
0,1,Alfredo,Gutiérrez,200.0,100.0
1,2,Juanito,Pérez,1000.0,500.0
2,3,Perenganito,López,400.0,200.0
3,5,Luis,Miguel,250.0,125.0

In [ ]:
# Select the total amount paid grouped by zip code and age buckets
query_4 = """
SELECT
    c.zipcode,
    -- Use a CASE statement to create age buckets
    CASE
        WHEN (strftime('%Y', 'now') - strftime('%Y', c.birthdate)) BETWEEN 18 AND 25 THEN '18-25'
        WHEN (strftime('%Y', 'now') - strftime('%Y', c.birthdate)) BETWEEN 26 AND 35 THEN '26-35'
        WHEN (strftime('%Y', 'now') - strftime('%Y', c.birthdate)) > 35 THEN '36+'
        ELSE 'Under 18'
    END AS age_bucket,
    SUM(p.amount_paid) AS total_paid_by_group
FROM
    customers c
JOIN
    loans l ON c.id = l.id
JOIN
    payments p ON l.id = p.id
WHERE
    p.amount_paid IS NOT NULL
GROUP BY
    c.zipcode, age_bucket
ORDER BY
    c.zipcode, age_bucket;
"""

df4 = execute_query("atrato.db", query_4)
print("Total amount paid by zip code and age bucket:")
df4

Connected to database atrato.db successfully.
Total amount paid by zip code and age bucket:

   zipcode age_bucket  total_paid_by_group
0    07300      18-25                100.0
1   111111      26-35                200.0
2  1264823        36+                250.0
3  4832742        36+                500.0
4   716532        36+                500.0
5  9432723        36+                200.0
6    99999      26-35                100.0